## Re-applying using 5.87.0

The error still happens.
(So, the problem is not caused by a temporary change/degrade on AWS.)

```
terraform: 1.10.3
terraform-provider-aws: 5.87.0
```

### Resource configuration
```hcl
resource "aws_s3_bucket_lifecycle_configuration" "m***l" {
  bucket = aws_s3_bucket.m***l.id

  transition_default_minimum_object_size = "varies_by_storage_class"

  rule {
    id = "remove-zero-size-versions"
    filter {
      object_size_less_than = 1
    }
    noncurrent_version_expiration {
      noncurrent_days = 1
    }
    status = "Enabled"
  }

  rule {
    id = "remove-m***d-file-versions"
    filter {
      prefix = "m***m/m***d"
    }
    noncurrent_version_expiration {
      newer_noncurrent_versions = 5
      noncurrent_days           = 1
    }
    status = "Enabled"
  }
}
```

### Terraform state
```json
    {
      "mode": "managed",
      "type": "aws_s3_bucket_lifecycle_configuration",
      "name": "m***l",
      "provider": "provider[\"registry.terraform.io/hashicorp/aws\"]",
      "instances": [
        {
          "schema_version": 1,
          "attributes": {
            "bucket": "***bucket***",
            "expected_bucket_owner": "",
            "id": "***bucket***",
            "rule": [
              {
                "abort_incomplete_multipart_upload": [],
                "expiration": [],
                "filter": [
                  {
                    "and": [],
                    "object_size_greater_than": null,
                    "object_size_less_than": 1,
                    "prefix": "",
                    "tag": []
                  }
                ],
                "id": "remove-zero-size-versions",
                "noncurrent_version_expiration": [
                  {
                    "newer_noncurrent_versions": null,
                    "noncurrent_days": 1
                  }
                ],
                "noncurrent_version_transition": [],
                "prefix": "",
                "status": "Enabled",
                "transition": []
              },
              {
                "abort_incomplete_multipart_upload": [],
                "expiration": [],
                "filter": [
                  {
                    "and": [],
                    "object_size_greater_than": null,
                    "object_size_less_than": null,
                    "prefix": "m***m/m***d",
                    "tag": []
                  }
                ],
                "id": "remove-m***d-file-versions",
                "noncurrent_version_expiration": [
                  {
                    "newer_noncurrent_versions": 5,
                    "noncurrent_days": 1
                  }
                ],
                "noncurrent_version_transition": [],
                "prefix": "",
                "status": "Enabled",
                "transition": []
              }
            ],
            "timeouts": null,
            "transition_default_minimum_object_size": null
          },
          "sensitive_attributes": [],
          "dependencies": [
            "aws_s3_bucket.m***l"
          ]
        }
      ]
    },
```

### Plan
```
  # aws_s3_bucket_lifecycle_configuration.m***l will be updated in-place
  ~ resource "aws_s3_bucket_lifecycle_configuration" "m***l" {
        id                                     = "***bucket***"
      + transition_default_minimum_object_size = "varies_by_storage_class"
        # (2 unchanged attributes hidden)

      ~ rule {
            id     = "remove-zero-size-versions"
            # (2 unchanged attributes hidden)

          ~ filter {
              + object_size_greater_than = (known after apply)
                # (2 unchanged attributes hidden)
            }

          ~ noncurrent_version_expiration {
              + newer_noncurrent_versions = (known after apply)
                # (1 unchanged attribute hidden)
            }
        }
      ~ rule {
            id     = "remove-m***d-file-versions"
            # (2 unchanged attributes hidden)

          ~ filter {
              + object_size_greater_than = (known after apply)
              + object_size_less_than    = (known after apply)
                # (1 unchanged attribute hidden)
            }

            # (1 unchanged block hidden)
        }
    }
```

### Apply
```
╷
│ Error: updating S3 Bucket (***bucket***) Lifecycle Configuration
│ 
│   with aws_s3_bucket_lifecycle_configuration.m***l,
│   on m***o.tf line 21, in resource "aws_s3_bucket_lifecycle_configuration" "m***l":
│   21: resource "aws_s3_bucket_lifecycle_configuration" "m***l" {
│ 
│ operation error S3: PutBucketLifecycleConfiguration, https response error
│ StatusCode: 400, RequestID: ******, HostID:
│ ****************,
│ api error MalformedXML: The XML you provided was not well-formed or did not
│ validate against our published schema
╵
```

### Debug log
```json
{
  "@caller": "github.com/hashicorp/aws-sdk-go-base/v2@v2.0.0-beta.62/logging/tf_logger.go:45",
  "@level": "debug",
  "@message": "HTTP Request Sent",
  "@module": "aws",
  "@timestamp": "2025-03-21T12:20:02.199621+09:00",
  "aws.region": "ap-northeast-1",
  "http.method": "PUT",
  "http.request.body": "<LifecycleConfiguration xmlns=\"http://s3.amazonaws.com/doc/2006-03-01/\"><Rule><Filter><ObjectSizeLessThan>1</ObjectSizeLessThan><Prefix></Prefix></Filter><ID>remove-zero-size-versions</ID><NoncurrentVersionExpiration><NoncurrentDays>1</NoncurrentDays></NoncurrentVersionExpiration><Status>Enabled</Status></Rule><Rule><Filter><Prefix>m***m/m***d</Prefix></Filter><ID>remove-m***d-file-versions</ID><NoncurrentVersionExpiration><NewerNoncurrentVersions>5</NewerNoncurrentVersions><NoncurrentDays>1</NoncurrentDays></NoncurrentVersionExpiration><Status>Enabled</Status></Rule></LifecycleConfiguration>\n",
  "http.request.header.accept_encoding": "identity",
  "http.request.header.amz_sdk_invocation_id": "28285991-53d8-48a3-b5c7-8a1b6f93f191",
  "http.request.header.amz_sdk_request": "attempt=1; max=25",
  "http.request.header.authorization": "AWS4-HMAC-SHA256 Credential=ASIA************3V6L/20250321/ap-northeast-1/s3/aws4_request, SignedHeaders=accept-encoding;amz-sdk-invocation-id;amz-sdk-request;content-length;content-type;host;x-amz-checksum-crc32;x-amz-content-sha256;x-amz-date;x-amz-security-token;x-amz-transition-default-minimum-object-size, Signature=*****",
  "http.request.header.content_type": "application/xml",
  "http.request.header.x_amz_checksum_crc32": "GOE3xA==",
  "http.request.header.x_amz_content_sha256": "4d1ed01f1ba65771633ef5b324a0b388326f46d3ea5b1c0329f67d1aa4dea7ca",
  "http.request.header.x_amz_date": "20250321T032002Z",
  "http.request.header.x_amz_security_token": "*****",
  "http.request.header.x_amz_transition_default_minimum_object_size": "varies_by_storage_class",
  "http.request_content_length": 606,
  "http.url": "https://s3.ap-northeast-1.amazonaws.com/***bucket***?lifecycle=",
  "http.user_agent": "APN/1.0 HashiCorp/1.0 Terraform/1.10.3 (+https://www.terraform.io) terraform-provider-aws/5.87.0 (+https://registry.terraform.io/providers/hashicorp/aws) aws-sdk-go-v2/1.36.1 ua/2.1 os/linux lang/go#1.23.5 md/GOOS#linux md/GOARCH#amd64 api/s3#1.76.1 m/Z",
  "net.peer.name": "s3.ap-northeast-1.amazonaws.com",
  "rpc.method": "PutBucketLifecycleConfiguration",
  "rpc.service": "S3",
  "rpc.system": "aws-api",
  "tf_aws.sdk": "aws-sdk-go-v2",
  "tf_aws.signing_region": "",
  "tf_mux_provider": "*proto5server.Server",
  "tf_provider_addr": "registry.terraform.io/hashicorp/aws",
  "tf_req_id": "a211af20-7407-9c1d-6840-ae598e7e8532",
  "tf_resource_type": "aws_s3_bucket_lifecycle_configuration",
  "tf_rpc": "ApplyResourceChange",
  "timestamp": "2025-03-21T12:20:02.199+0900"
}
```

Request sent to AWS API (from above debug log):
```xml
<LifecycleConfiguration xmlns=\"http://s3.amazonaws.com/doc/2006-03-01/\">
  <Rule>
    <Filter>
      <ObjectSizeLessThan>1</ObjectSizeLessThan>
      <Prefix></Prefix>
    </Filter>
    <ID>remove-zero-size-versions</ID>
    <NoncurrentVersionExpiration>
      <NoncurrentDays>1</NoncurrentDays>
    </NoncurrentVersionExpiration>
    <Status>Enabled</Status>
  </Rule>
  <Rule>
    <Filter>
      <Prefix>m***m/m***d</Prefix>
    </Filter>
    <ID>remove-m***d-file-versions</ID>
    <NoncurrentVersionExpiration>
      <NewerNoncurrentVersions>5</NewerNoncurrentVersions>
      <NoncurrentDays>1</NoncurrentDays>
    </NoncurrentVersionExpiration>
    <Status>Enabled</Status>
  </Rule>
</LifecycleConfiguration>
```

## Applying using 5.92.0

Succeeded even for the same plan diff output.

```
terraform: 1.10.3
terraform-provider-aws: 5.92.0
```

### Plan
```
  # aws_s3_bucket_lifecycle_configuration.m***l will be updated in-place
  ~ resource "aws_s3_bucket_lifecycle_configuration" "m***l" {
        id                                     = "***bucket***"
      + transition_default_minimum_object_size = "varies_by_storage_class"
        # (2 unchanged attributes hidden)

      ~ rule {
            id     = "remove-zero-size-versions"
          + prefix = (known after apply)
            # (1 unchanged attribute hidden)

          ~ filter {
              + object_size_greater_than = (known after apply)
              + prefix                   = (known after apply)
                # (1 unchanged attribute hidden)
            }

          ~ noncurrent_version_expiration {
              + newer_noncurrent_versions = (known after apply)
                # (1 unchanged attribute hidden)
            }
        }
      ~ rule {
            id     = "remove-m***d-file-versions"
          + prefix = (known after apply)
            # (1 unchanged attribute hidden)

          ~ filter {
              + object_size_greater_than = (known after apply)
              + object_size_less_than    = (known after apply)
                # (1 unchanged attribute hidden)
            }

            # (1 unchanged block hidden)
        }
    }
```

### Apply
Succeeded

### Debug log
```json
{ 
  "@caller": "github.com/hashicorp/aws-sdk-go-base/v2@v2.0.0-beta.63/logging/tf_logger.go:45",
  "@level": "debug", 
  "@message": "HTTP Request Sent",
  "@module": "aws",
  "@timestamp": "2025-03-21T13:11:53.874603+09:00",
  "aws.region": "ap-northeast-1",
  "http.method": "PUT",
  "http.request.body": "<LifecycleConfiguration xmlns=\"http://s3.amazonaws.com/doc/2006-03-01/\"><Rule><Filter><ObjectSizeLessThan>1</ObjectSizeLessThan></Filter><ID>remove-zero-size-versions</ID><NoncurrentVersionExpiration><NoncurrentDays>1</NoncurrentDays></NoncurrentVersionExpiration><Status>Enabled</Status></Rule><Rule><Filter><Prefix>m***m/m***d</Prefix></Filter><ID>remove-m***d-file-versions</ID><NoncurrentVersionExpiration><NewerNoncurrentVersions>5</NewerNoncurrentVersions><NoncurrentDays>1</NoncurrentDays></NoncurrentVersionExpiration><Status>Enabled</Status></Rule></LifecycleConfiguration>\n",
  "http.request.header.accept_encoding": "identity",
  "http.request.header.amz_sdk_invocation_id": "118bd2e3-6890-46ca-9e45-2d68638b83f8",
  "http.request.header.amz_sdk_request": "attempt=1; max=25",
  "http.request.header.authorization": "AWS4-HMAC-SHA256 Credential=ASIA************3V6L/20250321/ap-northeast-1/s3/aws4_request, SignedHeaders=accept-encoding;amz-sdk-invocation-id;amz-sdk-request;content-length;content-type;host;x-amz-checksum-crc32;x-amz-content-sha256;x-amz-date;x-amz-security-token;x-amz-transition-default-minimum-object-size, Signature=*****",
  "http.request.header.content_type": "application/xml",
  "http.request.header.x_amz_checksum_crc32": "Kq1yIg==",
  "http.request.header.x_amz_content_sha256": "51c184689c5b6e38c988b8e89ada81eb9c64216b787add2224a5ec36d06f7dbe",
  "http.request.header.x_amz_date": "20250321T041153Z",
  "http.request.header.x_amz_security_token": "*****",
  "http.request.header.x_amz_transition_default_minimum_object_size": "varies_by_storage_class",
  "http.request_content_length": 589,
  "http.url": "https://s3.ap-northeast-1.amazonaws.com/***bucket***?lifecycle=",
  "http.user_agent": "APN/1.0 HashiCorp/1.0 Terraform/1.10.3 (+https://www.terraform.io) terraform-provider-aws/5.92.0 (+https://registry.terraform.io/providers/hashicorp/aws) aws-sdk-go-v2/1.36.3 ua/2.1 os/linux lang/go#1.23.7 md/GOOS#linux md/GOARCH#amd64 api/s3#1.78.2 m/Z,n",
  "net.peer.name": "s3.ap-northeast-1.amazonaws.com",
  "rpc.method": "PutBucketLifecycleConfiguration",
  "rpc.service": "S3",
  "rpc.system": "aws-api",
  "tf_aws.sdk": "aws-sdk-go-v2",
  "tf_aws.signing_region": "",
  "tf_mux_provider": "*proto5server.Server",
  "tf_provider_addr": "registry.terraform.io/hashicorp/aws",
  "tf_req_id": "81df185a-1af0-44c8-6732-26abdada8530",
  "tf_resource_type": "aws_s3_bucket_lifecycle_configuration",
  "tf_rpc": "ApplyResourceChange",
  "timestamp": "2025-03-21T13:11:53.874+0900"
}
```

Request sent to AWS API (from above debug log):
```xml
<LifecycleConfiguration xmlns=\"http://s3.amazonaws.com/doc/2006-03-01/\">
  <Rule>
    <Filter>
      <ObjectSizeLessThan>1</ObjectSizeLessThan>
    </Filter>
    <ID>remove-zero-size-versions</ID>
    <NoncurrentVersionExpiration>
      <NoncurrentDays>1</NoncurrentDays>
    </NoncurrentVersionExpiration>
    <Status>Enabled</Status>
  </Rule>
  <Rule>
    <Filter>
      <Prefix>m***m/m***d</Prefix>
    </Filter>
    <ID>remove-m***d-file-versions</ID>
    <NoncurrentVersionExpiration>
      <NewerNoncurrentVersions>5</NewerNoncurrentVersions>
      <NoncurrentDays>1</NoncurrentDays>
    </NoncurrentVersionExpiration>
    <Status>Enabled</Status>
  </Rule>
</LifecycleConfiguration>
```

Confirmed that `<Prefix></Prefix>` is disappeared.
